# Terraform environment yt01
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
module.appsettings.data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["14e02a1e-3292-430e-ae4f-855ed40847fd"].data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["b367c518-e46e-4dba-bd16-458eb1334163"].data.azurerm_resource_group.hub: Reading...
module.rbac.data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["b367c518-e46e-4dba-bd16-458eb1334163"].data.azurerm_client_config.hub: Reading...
data.azurerm_private_dns_zone.postgres: Reading...
module.rbac_platform_app["14e02a1e-3292-430e-ae4f-855ed40847fd"].data.azurerm_client_config.hub: Reading...
module.appsettings.data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["b367c518-e46e-4dba-bd16-458eb1334163"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["14e02a1e-3292-430e-ae4f-855ed40847fd"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.appsettings.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac.data.azurerm_client_config.hub: Reading...
module.rbac.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["b367c518-e46e-4dba-bd16-458eb1334163"].data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.appsettings.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["14e02a1e-3292-430e-ae4f-855ed40847fd"].data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
data.azurerm_private_dns_zone.postgres: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]
module.postgres_server.data.azurerm_client_config.current: Reading...
module.key_vault.data.azurerm_client_config.current: Reading...
module.rbac.data.azurerm_resource_group.spoke: Reading...
data.azurerm_user_assigned_identity.admin: Reading...
data.azurerm_client_config.current: Reading...
module.rbac_platform_app["14e02a1e-3292-430e-ae4f-855ed40847fd"].data.azurerm_resource_group.spoke: Reading...
data.azurerm_subnet.default: Reading...
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Reading...
module.rbac_platform_app["b367c518-e46e-4dba-bd16-458eb1334163"].data.azurerm_resource_group.spoke: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.postgres_server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_subnet.postgres: Reading...
module.key_vault.data.azurerm_private_dns_zone.key_vault: Reading...
module.key_vault.data.azurerm_resource_group.key_vault: Reading...
module.rbac_platform_app["14e02a1e-3292-430e-ae4f-855ed40847fd"].data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01]
module.key_vault.data.azurerm_resource_group.key_vault: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001yt01]
module.key_vault.data.azurerm_private_dns_zone.key_vault: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
data.azurerm_subnet.postgres: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Network/virtualNetworks/vnetssaltinnauth001yt01/subnets/Postgres]
module.rbac_platform_app["b367c518-e46e-4dba-bd16-458eb1334163"].data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01]
module.rbac_platform_app["14e02a1e-3292-430e-ae4f-855ed40847fd"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["b367c518-e46e-4dba-bd16-458eb1334163"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
data.azurerm_subnet.default: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001yt01/subnets/Default]
module.rbac.data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
data.azurerm_user_assigned_identity.admin: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mipgsqladminaltinnauth001yt01]
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.OperationalInsights/workspaces/logdwhaltinnauth001yt01]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001yt01]
module.rbac_platform_app["14e02a1e-3292-430e-ae4f-855ed40847fd"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001yt01]
module.rbac_platform_app["b367c518-e46e-4dba-bd16-458eb1334163"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001yt01]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault_secret.postgres_app will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_app" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001yt01/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001yt01"
      + name                    = "db-psqlsrvaltinnauthregister001yt01-register-app"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.postgres_migration will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_migration" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001yt01/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001yt01"
      + name                    = "db-psqlsrvaltinnauthregister001yt01-register-migrator"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # null_resource.bootstrap_database must be replaced
-/+ resource "null_resource" "bootstrap_database" {
      ~ id       = "8862912028310659118" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "ts" = "2025-03-03T22:05:15Z" -> (known after apply)
        }
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Postgres:AppConnectionString_yt01-register"] will be updated in-place
  ~ resource "azurerm_app_configuration_key" "key_vault_reference" {
        id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Postgres:AppConnectionString?label=yt01-register"
        tags                   = {}
      ~ vault_key_reference    = "https://kvregaltinnauth001yt01.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001yt01-register-app" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Postgres:MigrationConnectionString_yt01-register"] will be updated in-place
  ~ resource "azurerm_app_configuration_key" "key_vault_reference" {
        id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Postgres:MigrationConnectionString?label=yt01-register"
        tags                   = {}
      ~ vault_key_reference    = "https://kvregaltinnauth001yt01.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001yt01-register-migrator" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.postgres_server.data.azurerm_private_dns_a_record.postgres[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_private_dns_a_record" "postgres" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "f45a193f35c4"
      + records             = (known after apply)
      + resource_group_name = "rgaltinnauth001hub"
      + tags                = (known after apply)
      + ttl                 = (known after apply)
      + zone_name           = "privatelink.postgres.database.azure.com"
    }

  # module.postgres_server.azurerm_postgresql_flexible_server.postgres_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "postgres_server" {
      ~ administrator_password        = (sensitive value)
        id                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001yt01/providers/Microsoft.DBforPostgreSQL/flexibleServers/psqlsrvaltinnauthregister001yt01"
        name                          = "psqlsrvaltinnauthregister001yt01"
        tags                          = {}
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postgres_server.azurerm_private_dns_a_record.hex[0] will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "hex" {
        id                  = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001yt01/providers/Microsoft.Network/privateDnsZones/f45a193f35c4.privatelink.postgres.database.azure.com/A/@"
        name                = "@"
      ~ records             = [
          - "10.202.160.4",
        ] -> (known after apply)
        tags                = {}
        # (4 unchanged attributes hidden)
    }

  # module.postgres_server.random_password.pass must be replaced
-/+ resource "random_password" "pass" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "trigger" = "2025-03-03T22:04:09Z" -> (known after apply)
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `workflow_dispatch` |
| Working Directory | `src/apps/Altinn.Register/infra` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/yt01/altinn.register.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_yt01_altinn.register.tfstate.tfplan`